{
  "game": {
    "title": "Morpion",
    "playerWins": "Le joueur {{player}} gagne !",
    "draw": "C'est un match nul !",
    "playerTurn": "Tour du joueur {{player}}",
    "newGame": "Nouvelle partie",
    "playerX": "Joueur X",
    "playerO": "Joueur O"
  },
  "language": {
    "switch": "Changer de langue",
    "english": "Anglais",
    "french": "Français"
  },
  "nav": {
    "home": "Accueil",
    "chat": "Chat",
    "games": "Jeux",
    "about": "À propos",
    "branding": "Jeux Electron",
    "games_menu": {
      "tetris": "Tetris",
      "tictactoe": "Morpion",
      "tetris_description": "Jeu de puzzle classique d'empilement de blocs",
      "tictactoe_description": "Jeu de stratégie classique à deux joueurs"
    }
  },
  "navigation": {
    "home": "Accueil",
    "about": "À propos"
  },
  "about": {
    "title": "À propos",
    "description": "Une application React Electron avec ShadcnUI et Tailwind intégrés. TypeScript, testé avec Jest.",
    "version": "Version",
    "author": "Auteur",
    "license": "Licence",
    "viewLicense": "Voir la licence"
  },
  "license": {
    "title": "Licence",
    "main": "Licence principale",
    "close": "Fermer",
    "content": "Licence MIT\n\nCopyright (c) 2025 trev-z-dev\n\nPar la présente, l'autorisation est accordée, gratuitement, à toute personne obtenant une copie de ce logiciel et des fichiers de documentation associés (le \"Logiciel\"), de traiter le Logiciel sans restriction, y compris sans limitation les droits d'utiliser, copier, modifier, fusionner, publier, distribuer, sous-licencier et/ou vendre des copies du Logiciel, et de permettre aux personnes à qui le Logiciel est fourni de le faire, sous réserve des conditions suivantes :\n\nL'avis de copyright ci-dessus et cet avis d'autorisation doivent être inclus dans toutes les copies ou parties substantielles du Logiciel.\n\nLE LOGICIEL EST FOURNI \"TEL QUEL\", SANS GARANTIE D'AUCUNE SORTE, EXPLICITE OU IMPLICITE, Y COMPRIS MAIS SANS S'Y LIMITER LES GARANTIES DE QUALITÉ MARCHANDE, D'ADÉQUATION À UN USAGE PARTICULIER ET DE NON-CONTREFAÇON. EN AUCUN CAS LES AUTEURS OU LES DÉTENTEURS DU COPYRIGHT NE SERONT RESPONSABLES DE TOUTE RÉCLAMATION, DOMMAGE OU AUTRE RESPONSABILITÉ, QUE CE SOIT DANS UNE ACTION CONTRACTUELLE, DÉLICTUELLE OU AUTRE, DÉCOULANT DE, HORS DE OU EN RELATION AVEC LE LOGICIEL OU L'UTILISATION OU D'AUTRES TRANSACTIONS DANS LE LOGICIEL."
  },
  "tetris": {
    "title": "Tetris",
    "score": "Score",
    "level": "Niveau",
    "lines": "Lignes",
    "next": "Suivant",
    "controls": "Contrôles :",
    "controlMoveLeft": "← → : Déplacer gauche/droite",
    "controlSoftDrop": "↓ : Chute douce",
    "controlRotate": "↑ : Rotation",
    "controlHardDrop": "Espace : Chute rapide",
    "controlPause": "P : Pause/Reprendre",
    "startGame": "Commencer",
    "newGame": "Nouvelle partie",
    "pause": "Pause",
    "resume": "Reprendre",
    "gameOver": "Jeu terminé !",
    "finalScore": "Score final : {{score}}",
    "newHighScore": "Nouveau meilleur score !",
    "congratulations": "Félicitations ! Vous avez marqué {{score}} points !",
    "enterName": "Entrez votre nom :",
    "nameInputPlaceholder": "Votre nom",
    "saveScore": "Sauvegarder le score",
    "skip": "Ignorer"
  },
  "highScores": {
    "gameTitle": "Meilleurs scores {{game}}",
    "allGamesTitle": "Meilleurs scores tous jeux",
    "loading": "Chargement...",
    "loadError": "Échec du chargement des meilleurs scores",
    "clearError": "Échec de la suppression des scores",
    "deleteError": "Échec de la suppression du score",
    "retry": "Réessayer",
    "refresh": "Actualiser",
    "clear": "Effacer tout",
    "clearConfirm": "Êtes-vous sûr de vouloir effacer tous les scores ? Cette action ne peut pas être annulée.",
    "deleteConfirm": "Êtes-vous sûr de vouloir supprimer ce score ?",
    "noScores": "Aucun meilleur score pour le moment. Jouez à un jeu pour commencer !",
    "rank": "Rang",
    "name": "Nom",
    "score": "Score",
    "date": "Date",
    "actions": "Actions",
    "delete": "Supprimer"
  },
  "chat": "Chat",
  "newChat": "Nouveau Chat",
  "conversations": "Conversations",
  "loading": "Chargement",
  "noChats": "Aucun chat pour le moment. Commencez une nouvelle conversation !",
  "deleteChat": "Supprimer le chat",
  "LLAMA-3.2-COMMUNITY-LICENSE-AGREEMENT": {
    "name": "Accord de licence communautaire Llama 3.2",
    "content": "# LLAMA 3.2 COMMUNITY LICENSE AGREEMENT\n\n**Llama 3.2 Version Release Date: September 25, 2024**\n\n\"Agreement\" means the terms and conditions for use, reproduction, distribution and modification of the Llama Materials set forth herein.\n\n\"Documentation\" means the specifications, manuals and documentation accompanying Llama 3.2 distributed by Meta at https://www.llama.com/docs/overview.\n\n\"Licensee\" or \"you\" means you, or your employer or any other person or entity (if you are entering into this Agreement on such person or entity's behalf), of the age required under applicable laws, rules or regulations to provide legal consent and that has legal authority to bind your employer or such other person or entity if you are entering in this Agreement on their behalf.\n\n\"Llama 3.2\" means the foundational large language models and software and algorithms, including machine-learning model code, trained model weights, inference-enabling code, training-enabling code, fine-tuning enabling code and other elements of the foregoing distributed by Meta at https://www.llama.com/llama-downloads.\n\n\"Llama Materials\" means, collectively, Meta's proprietary Llama 3.2 and Documentation (and any portion thereof) made available under this Agreement.\n\n\"Meta\" or \"we\" means Meta Platforms Ireland Limited (if you are located in or, if you are an entity, your principal place of business is in the EEA or Switzerland) and Meta Platforms, Inc. (if you are located outside of the EEA or Switzerland).\n\nBy clicking \"I Accept\" below or by using or distributing any portion or element of the Llama Materials, you agree to be bound by this Agreement.\n\n## 1. License Rights and Redistribution.\n\n**a. Grant of Rights.** You are granted a non-exclusive, worldwide, non-transferable and royalty-free limited license under Meta's intellectual property or other rights owned by Meta embodied in the Llama Materials to use, reproduce, distribute, copy, create derivative works of, and make modifications to the Llama Materials.\n\n**b. Redistribution and Use.**\n\n**i.** If you distribute or make available the Llama Materials (or any derivative works thereof), or a product or service (including another AI model) that contains any of them, you shall (A) provide a copy of this Agreement with any such Llama Materials; and (B) prominently display \"Built with Llama\" on a related website, user interface, blogpost, about page, or product documentation. If you use the Llama Materials or any outputs or results of the Llama Materials to create, train, fine tune, or otherwise improve an AI model, which is distributed or made available, you shall also include \"Llama\" at the beginning of any such AI model name.\n\n**ii.** If you receive Llama Materials, or any derivative works thereof, from a Licensee as part of an integrated end user product, then Section 2 of this Agreement will not apply to you.\n\n**iii.** You must retain in all copies of the Llama Materials that you distribute the following attribution notice within a \"Notice\" text file distributed as a part of such copies: \"Llama 3.2 is licensed under the Llama 3.2 Community License, Copyright © Meta Platforms, Inc. All Rights Reserved.\"\n\n**iv.** Your use of the Llama Materials must comply with applicable laws and regulations (including trade compliance laws and regulations) and adhere to the Acceptable Use Policy for the Llama Materials (available at https://www.llama.com/llama3_2/use-policy), which is hereby incorporated by reference into this Agreement.\n\n## 2. Additional Commercial Terms.\n\nIf, on the Llama 3.2 version release date, the monthly active users of the products or services made available by or for Licensee, or Licensee's affiliates, is greater than 700 million monthly active users in the preceding calendar month, you must request a license from Meta, which Meta may grant to you in its sole discretion, and you are not authorized to exercise any of the rights under this Agreement unless or until Meta otherwise expressly grants you such rights.\n\n## 3. Disclaimer of Warranty.\n\nUNLESS REQUIRED BY APPLICABLE LAW, THE LLAMA MATERIALS AND ANY OUTPUT AND RESULTS THEREFROM ARE PROVIDED ON AN \"AS IS\" BASIS, WITHOUT WARRANTIES OF ANY KIND, AND META DISCLAIMS ALL WARRANTIES OF ANY KIND, BOTH EXPRESS AND IMPLIED, INCLUDING, WITHOUT LIMITATION, ANY WARRANTIES OF TITLE, NON-INFRINGEMENT, MERCHANTABILITY, OR FITNESS FOR A PARTICULAR PURPOSE. YOU ARE SOLELY RESPONSIBLE FOR DETERMINING THE APPROPRIATENESS OF USING OR REDISTRIBUTING THE LLAMA MATERIALS AND ASSUME ANY RISKS ASSOCIATED WITH YOUR USE OF THE LLAMA MATERIALS AND ANY OUTPUT AND RESULTS.\n\n## 4. Limitation of Liability.\n\nIN NO EVENT WILL META OR ITS AFFILIATES BE LIABLE UNDER ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, TORT, NEGLIGENCE, PRODUCTS LIABILITY, OR OTHERWISE, ARISING OUT OF THIS AGREEMENT, FOR ANY LOST PROFITS OR ANY INDIRECT, SPECIAL, CONSEQUENTIAL, INCIDENTAL, EXEMPLARY OR PUNITIVE DAMAGES, EVEN IF META OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF ANY OF THE FOREGOING.\n\n## 5. Intellectual Property.\n\n**a.** No trademark licenses are granted under this Agreement, and in connection with the Llama Materials, neither Meta nor Licensee may use any name or mark owned by or associated with the other or any of its affiliates, except as required for reasonable and customary use in describing and redistributing the Llama Materials or as set forth in this Section 5(a). Meta hereby grants you a license to use \"Llama\" (the \"Mark\") solely as required to comply with the last sentence of Section 1.b.i. You will comply with Meta's brand guidelines (currently accessible at https://about.meta.com/brand/resources/meta/company-brand/). All goodwill arising out of your use of the Mark will inure to the benefit of Meta.\n\n**b.** Subject to Meta's ownership of Llama Materials and derivatives made by or for Meta, with respect to any derivative works and modifications of the Llama Materials that are made by you, as between you and Meta, you are and will be the owner of such derivative works and modifications.\n\n**c.** If you institute litigation or other proceedings against Meta or any entity (including a cross-claim or counterclaim in a lawsuit) alleging that the Llama Materials or Llama 3.2 outputs or results, or any portion of any of the foregoing, constitutes infringement of intellectual property or other rights owned or licensable by you, then any licenses granted to you under this Agreement shall terminate as of the date such litigation or claim is filed or instituted. You will indemnify and hold harmless Meta from and against any claim by any third party arising out of or related to your use or distribution of the Llama Materials.\n\n## 6. Term and Termination.\n\nThe term of this Agreement will commence upon your acceptance of this Agreement or access to the Llama Materials and will continue in full force and effect until terminated in accordance with the terms and conditions herein. Meta may terminate this Agreement if you are in breach of any term or condition of this Agreement. Upon termination of this Agreement, you shall delete and cease use of the Llama Materials. Sections 3, 4 and 7 shall survive the termination of this Agreement.\n\n## 7. Governing Law and Jurisdiction.\n\nThis Agreement will be governed and construed under the laws of the State of California without regard to choice of law principles, and the UN Convention on Contracts for the International Sale of Goods does not apply to this Agreement. The courts of California shall have exclusive jurisdiction of any dispute arising out of this Agreement."
  }
}
